Repository: Kaburumwenda/KE-farmers
Catalog: HOME/locale/*/LC_MESSAGES/django.po
Languages: sw

source: Home
sw: Nyumbani

source: About Us
sw: Kuhusu sisi

source: Contact Page
sw: Ukurasa wa Mawasiliano

source: Contact Form
sw: Fomu ya Mawasiliano

source: SEND FORM
sw: TUMA FOMU

source: Contact Information
sw: Habari ya Mawasiliano

source: Categories
sw: Jamii

source: Account
sw: Akaunti

source: Cart
sw: Ununuzi

source: FAQ
sw: maswali yanayoulizwa mara kwa mara

source: All Categories
sw: Jumia yote

source: My Account
sw: Akaunti yangu

source: My Favorits
sw: Vipendwa vyangu

source: My Orders
sw: Amri zangu

source: My Comments
sw: Maoni yangu

source: Logout
sw: Toka

source: My Cart:
sw: Ununuzi Wangu

source: Quick view
sw: Mtazamo wa haraka

source: Currencies
sw: Fedha

source: Currency Calculator
sw: Calculator ya Fedha

source: Select Your favorite Currency
sw: Chagua Fedha yako uipendayo

source: Available Currencies
sw: Fedha zinazopatikana

source: Discover Mesh-Mall
sw: Gundua Mesh-Mall

source: Shop in 5 Languages
sw: Nunua kwa Lugha 5

source: Free Home Delivery
sw: Uwasilishaji Nyumbani Bure

source: Shop in 20+ Currencies
sw: Nunua katika sarafu 20+

source: Account Setting
sw: Mipangilio ya Akaunti

source: Secure Payment
sw: Malipo salama

source: 24/7 Customer Support
sw: Msaada wa Wateja 24/7

source: Track your Package
sw: Fuatilia mzigo wako

source: Contact Us
sw: Wasiliana nasi

source: Save
sw: Hifadhi

source: All
sw: Jumla

source: Login
sw: Ingia

source: Sign up
sw: Jisajili

source: Settings
sw: Mipangilio

source: Languages
sw: Lugha

source: Language Translator
sw: Mtafsiri wa Lugha

source: Select Your favorite Language
sw: Chagua Lugha unayoipenda

source: Kimeru is denoted by
sw: Kimeru ameonyeshwa na

source: Available Languages
sw: Lugha Zinazopatikana

source: Latest Products
sw: Bidhaa za Hivi karibuni

source: Picked For You
sw: Imechukuliwa kwa ajili yako

source: Review(s)
sw: Maoni

source: Add Review
sw: Ongeza Mapitio

source: Brand
sw: Aina

source: Top Selling
sw: Uuzaji wa juu

source: Top Rated
sw: Imekadiriwa juu

source: New in
sw: Mpya katika

source: Above 50%% off
sw: Zaidi ya 50% imezimwa
